---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RenderPlantName
source: html/eb2b95a1-454e-1bf7-882b-ee3338e6579f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RenderPlantName Property

"Plant Name"

## Syntax (C#)
```csharp
public static ForgeTypeId RenderPlantName { get; }
```